---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BeamSystem3dParam
source: html/6e8ade0e-d9dd-440e-b7fa-6a6f38c50007.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BeamSystem3dParam Property

"3D"

## Syntax (C#)
```csharp
public static ForgeTypeId BeamSystem3dParam { get; }
```